### importanto pandas

In [3]:
import pandas as pd

In [4]:
df = pd.DataFrame({"Species": ['Chinook', 'Chun', 'Coho', 'Steelhead', 'Bull Trout'],
                  "Population": ['Skokomish', 'Lower Skokomish', 'Skokomish', 'Skokomish', 'SF Skokomish'],
                  "Count": [1208, 2396, 3220, 6245, 8216]})
df

      Species       Population  Count
0     Chinook        Skokomish   1208
1        Chun  Lower Skokomish   2396
2        Coho        Skokomish   3220
3   Steelhead        Skokomish   6245
4  Bull Trout     SF Skokomish   8216

### categorizando dados numéricos com pd.cut

In [5]:
import numpy as np
bins = [0, 2000, 4000, 6000, 8000, np.inf]
labels = ['Low Return', 'Below Avg Return', 'Avg Return', 'Above Avg Return', 'High Return']

In [6]:
df['Count Category'] = pd.cut(df['Count'], bins, labels = labels)
df

      Species       Population  Count    Count Category
0     Chinook        Skokomish   1208        Low Return
1        Chun  Lower Skokomish   2396  Below Avg Return
2        Coho        Skokomish   3220  Below Avg Return
3   Steelhead        Skokomish   6245  Above Avg Return
4  Bull Trout     SF Skokomish   8216       High Return

### mapear espécies para o status de ameaçadas

In [7]:
fed_status = {"Chinook": "Threatened",
             "Chum": "Not Warranted",
             "Coho": "Not Warranted",
             "Steelhead": "Threatened"}

In [8]:
df['Federal Status'] = df['Species'].map(fed_status)
df

      Species       Population  Count    Count Category Federal Status
0     Chinook        Skokomish   1208        Low Return     Threatened
1        Chun  Lower Skokomish   2396  Below Avg Return            NaN
2        Coho        Skokomish   3220  Below Avg Return  Not Warranted
3   Steelhead        Skokomish   6245  Above Avg Return     Threatened
4  Bull Trout     SF Skokomish   8216       High Return            NaN

### introduzindo o tipo de dados categórico

In [9]:
df['Count Category'] = pd.Categorical(df['Count Category'],
                                     ordered = True,
                                     categories = labels)
df['Count Category']

0          Low Return
1    Below Avg Return
2    Below Avg Return
3    Above Avg Return
4         High Return
Name: Count Category, dtype: category
Categories (5, object): ['Low Return' < 'Below Avg Return' < 'Avg Return' < 'Above Avg Return' < 'High Return']

In [10]:
df.sort_values(by = ['Count Category'], ascending = False)

      Species       Population  Count    Count Category Federal Status
4  Bull Trout     SF Skokomish   8216       High Return            NaN
3   Steelhead        Skokomish   6245  Above Avg Return     Threatened
1        Chun  Lower Skokomish   2396  Below Avg Return            NaN
2        Coho        Skokomish   3220  Below Avg Return  Not Warranted
0     Chinook        Skokomish   1208        Low Return     Threatened

### get_dummies() para converter uma variável categórica em variável fictícia

In [11]:
pd.get_dummies(df['Count Category'])

   Low Return  Below Avg Return  Avg Return  Above Avg Return  High Return
0        True             False       False             False        False
1       False              True       False             False        False
2       False              True       False             False        False
3       False             False       False              True        False
4       False             False       False             False         True